{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "from py2neo import Node, Relationship\n",
    "\n",
    "# neo4j graph connector\n",
    "graph = Graph()\n",
    "cypher = graph.cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "result = cypher.execute(\"MATCH (x:Concept{id:'Num:C5:SC1:MC2'})<-[r]-(y:Concept) RETURN y.id\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Num:C5:SC1\n"
     ]
    }
   ],
   "source": [
    "print((result[1])[\"y.id\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "r=cypher.execute(\"MATCH path=shortestpath( (x:Concept{id:'Num:C5:SC1:MC2'}) -[r:isParentOf*..6]-(y:Concept{id:'numeracy'}) ) RETURN length(path) as d\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n"
     ]
    }
   ],
   "source": [
    "print(r[0].d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "import requests\n",
    "url=\"http://lp-sandbox.ekstep.org:8080/taxonomy-service/v2/analytics/domain/map\"\n",
    "resp = requests.get(url).json()\n",
    "# move all concepts\n",
    "conceptList = resp[\"result\"][\"concepts\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Domain\n"
     ]
    }
   ],
   "source": [
    "print conceptList[0]['objectType']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# from neo4j, get list of concepts and content and create \"forced\" mapping between them\n",
    "A=cypher.execute(\"MATCH (x:Concept) RETURN x.id as concept\")\n",
    "B=cypher.execute(\"MATCH (x:Content) RETURN x.id as content\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "u'org.ekstep.mar8.story'"
      ]
     },
     "execution_count": 82,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "B[1].content"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "3"
      ]
     },
     "execution_count": 77,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import random;\n",
    "random.randint(1,10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2\n"
     ]
    }
   ],
   "source": [
    "print 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%matplotlib inline"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import csv\n",
    "import sys\n",
    "import collections\n",
    "import os.path\n",
    "import requests\n",
    "\n",
    "# matplotlib for plotting\n",
    "import matplotlib.pyplot as plt\n",
    "%matplotlib inline\n",
    "\n",
    "\n",
    "# on exit clean-ups\n",
    "import atexit\n",
    "\n",
    "# cassandra libs\n",
    "from cassandra.cluster import Cluster\n",
    "from cassandra.query import dict_factory\n",
    "\n",
    "\n",
    "# neo4j libs\n",
    "from py2neo import Graph\n",
    "from py2neo import Node, Relationship\n",
    "\n",
    "# neo4j graph connector\n",
    "graph = Graph()\n",
    "# delete entire graph\n",
    "\n",
    "\n",
    "# bool flag database connections\n",
    "cassandraDbOn=False\n",
    "neo4jDbOn=False\n",
    "\n",
    "def dbCleanUP(cassandraDbOn,neo4jDbOn):\n",
    "    if cassandraDbOn:\n",
    "    \tprint 'cleaning Cassandra state'\n",
    "    \tsession.shutdown();\n",
    "    \tcluster.shutdown();\n",
    "\n",
    "atexit.register(dbCleanUP,True,True)\n",
    "\n",
    "# # read-csv learner proficiency table\n",
    "# read_file = './data/CassandraLearnerProficiency.csv'\n",
    "\n",
    "# # first pass to get the list of students and graders\n",
    "# with open(read_file,'rb') as grade_file:\n",
    "# \tfor line in grade_file:\n",
    "# \t\tline = line.rstrip()\n",
    "# \t\tnames = line.split(',')\n",
    "\t\t\n",
    "# for name in names:\n",
    "# \tprint(name)\n",
    "\n",
    "\n",
    "# setup cassandra connection\n",
    "cassandraDbOn=True\n",
    "cluster = Cluster()\n",
    "session = cluster.connect('learner_db')\n",
    "\n",
    "# set response schema to Dictionaries\n",
    "session.row_factory = dict_factory\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "lids = session.execute(\"SELECT DISTINCT learner_id from learnerconceptrelevance\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-- above--- only KS\n",
      "KS,P,TS: 1,1,1 below, TSP is derived from concept-proficiency table\n",
      "learner is:9a221916-3f2c-4a83-baef-28b10bbec9f7\n",
      "concept relevancy scores:\n",
      "top 10 recommended concepts are:\n",
      "[(u'numeracy', 0.014550477230203827), (u'Num:C3', 0.012751711407475046), (u'Num:C4', 0.012474141279003127), (u'Num:C1', 0.01167472842847007), (u'Num:C2', 0.011432828782213356), (u'Num:C5', 0.0103051615546863), (u'Num:C3:SC1', 0.009216161134498973), (u'Num:C3:SC2', 0.008630555361020321), (u'Num:C3:SC3', 0.008630555361020321), (u'Num:C3:SC7', 0.008591513778599102)]\n",
      "bottom 10 recommended concepts are:\n",
      "[(u'LO26', 6.108052678090068e-06), (u'LO27', 6.974414798894649e-06), (u'LT05', 1.0856118094734877e-05), (u'LT01', 1.107708806583382e-05), (u'LT02', 1.107708806583382e-05), (u'LT03', 1.1920869458199398e-05), (u'LT04', 1.1920869458199398e-05), (u'LT06', 1.2358394771166798e-05), (u'LT09', 1.2358394771166798e-05), (u'LT07', 1.258563300934473e-05)]\n",
      "top concepts:\n",
      "[(u'Num:C4:SC4:MC11', 0.71), (u'Num:C3:SC2:MC5', 0.6), (u'Num:C4:SC5:MC9', 0.6)]\n",
      "bottom concepts:\n",
      "[(u'Num:C3:SC2:MC5', 0.6), (u'Num:C4:SC5:MC9', 0.6), (u'Num:C4:SC4:MC11', 0.71)]\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAYUAAAEACAYAAABcXmojAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJztnX+wHWWZ5z83ufcmhB+iLkMkyVT4OcKoI6tidladK+Ju\nEmuI5cwWoiMzWLVkdKPMaimirt7UWMJoOW4hK2ZmwIm/QIpFJpZAdKc8JWMUCUIAIWMCokmUwCTg\nkECSm3vP/vF23/PePqe737dPn3Pe7vP9VJ063X3et/s5ffq8z/s83/ftBiGEEEIIIYQQQgghhBBC\nCCGEEEIIIYQQQgghes5KYDuwA7gipcw10efbgHOt7TcAe4EHO9R5H/AI8BDwN2UZK4QQonfMB3YC\ny4Ex4H7g7ESZ1cDt0fJrgR9bn70e4ySSTuGNwPeifQKcVJrFQgghesZ/Au601j8SvWy+BFxkrW8H\nFlvry2l3CjcD55djohBCiLKYl/P5EmCXtb472uZbJsmZwBswUUUDeHWeoUIIIXrPaM7nTcf9jHjW\nGwVeCKwAXoOJHE5zPJYQQogekecU9gDLrPVlmEggq8zSaFsWu4Fbo+V7gBngxcA+u9Dpp5/efPTR\nR3N2JYQQIsGjwBlFKualj7ZiUj3LgXGMdrApUWYTcEm0vAJ4BjPiKIvbaGkKZ0X73pcs9Oijj9Js\nNiv7+uQnPzlwG4bRdtk/+JfsH+wLOD2nDU4lzykcBdYBm4GHgW9ihpGujV5gRh49hhmltAF4r1X/\nRmBL1PDvAi6Ntt+ASRc9GJW5BCGEEAMnL30EcEf0stmQWF+XUvfilO1TwLscji2EEKKP5EUKogsm\nJiYGbUJhqmw7yP5BI/urS3LUUGg0o/yYEEIIR0ZGRqBg+65IQQghxCxyCkIIIWaRUxBCCDGLnIIQ\nQohZ5BSEEELMIqcghBBiFjkFIYQQs8gpCCGEmEVOQQghxCxyCkIIIWaRUxBCCDGLnIIQQohZ5BSE\nEELMIqcghBAl8fWvwy23DNqK7nB5yI4QQggHHnoITjhh0FZ0hyIFIYQoiZkZGAn9KTU5yCkIIURJ\nNJvD4RRWAtuBHcAVKWWuiT7fBpxrbb8B2As8mFLvg8AM8CIXY4UQImSGwSnMB67FOIZzgIuBsxNl\nVgNnAGcClwHXWZ99OarbiWXAm4Ff+pkshBBhMgxO4TxgJ/A4MAXcBKxJlLkQ2Bgt3w2cCCyO1u8C\nnk7Z998CH/YzVwghwqXZhHkVT8rnmb8E2GWt7462+ZZJsiYq94CDjUIIUQnqIDTnDUltOu4neRqy\n6i0CPopJHaXVF0KIylGH9FGeU9iDyf3HLMP08LPKLI22pXE6sBwjSsfl78Wkqp5MFp6cnJxdnpiY\nYGJiIsdkIYQYDINyCo1Gg0ajUcq+8swfBf4VeBPwa+AnGLH5EavMamBd9L4C+N/Re8xy4NvAy1OO\n8QvgVcD+Dp81m03XYEUIIQbL+98Pp58Ol18+WDtGjGcq5J7yNIWjmAZ/M/Aw8E2MQ1gbvQBuBx7D\nCNIbgPda9W8EtgBnYXSHSzscQ62+EKIW1EFodrnNxR3Ry2ZDYn1dSt2LHfZ/mkMZIYQInjoIzRX3\naUIIEQ51EJrlFIQQoiTkFIQQQswipyCEEGKWOgjNFTdfCCHCQUKzEEKIWZQ+EkIIMYucghBCiFmk\nKQghhJhFmoIQQohZlD4SQggxi5yCEEKIWeQUhKgZ111n8sJCFEFCsxA146/+Cp57btBWiKoioVmI\nmtFswtTUoK0QVUXpIyFqxsyMnIIojpyCEDVDTmEuhw7Bxz8+aCuqg5yCEDVD6aO57N8PG5LPWRSp\nSGgWokY0o6eFyym0mJmBo0cHbUV1GCaheSWwHdgBXJFS5pro823Audb2G4C9wIOJ8p8FHonK3wq8\nwNEWIXpCPBRVTqGFnIIfw5I+mg9ci3EM5wAXA2cnyqwGzgDOBC4DrrM++3JUN8l3gd8H/gD4OXCl\nj+FClI2cQjvSWPwYFqdwHrATeByYAm4C1iTKXAhsjJbvBk4EFkfrdwFPd9jv94AZq85SV6OF6AVy\nCu0oUvBjWDSFJcAua313tM23TBbvBm73KC9E6UhTaGdmBqanW+dGZFOHSGHUoYzr5ZA8Fa71PgYc\nAb7R6cPJycnZ5YmJCSYmJhx3K4QfihTaic/J9DSMurQWQ86ghOZGo0Gj0ShlXy4/8x5gmbW+DBMJ\nZJVZGm3L4y8wesSb0grYTkGIXiKn0I59TuQU8hlUpJDsMK9fv77wvlzSR1sxAvJyYBy4CNiUKLMJ\nuCRaXgE8gxlxlMVK4EMYfeKQm7lC9A45hXbicyJdwY06pI9cnMJRYB2wGXgY+CZmKOna6AVGD3gM\nI0hvAN5r1b8R2AKchdEdLo22fwE4DiM43wd8sYvvIUTXSFNoR07BjzoIza4B4R3RyyY5z3FdSt2L\nU7af6Xhs4ciePfDAA7Bq1aAtqSZqANvROfFjWCIFURF+/GP40pcGbUV1UfqoHZ0TP4ZpRrOoAM2m\nenTdoAawHUUKfihSEEFRpYlGMzPwdKcpjQNEmkI7cgp+yCmIoGg2zXjyKvCDH8C73jVoK+aiSKEd\nOQU/6iA0V9x8YVOlSOH55+HgwUFbMRc5hXZ0TvyQpiCCokqaQog3WlMD2I4iBT+UPhJBUaVIIURb\npSm0I6fgh5yCCIoqRQrT0+E1vooU2pFT8ENOQQRFiL3vNEK0VU6hHZ0TPyQ0i6CoUqQgTaEaKFLw\nQ0KzCIoQe99phGirNIV25BT8UPpIBIUihe5QpNCOzokfcgoiKOKnZFWBECMFNYDtKFLwQ5qCCApF\nCt2h9FE7cgp+KFIQQRFi7zuNEG1VpNCOnIIfEppFUFQpUtA8hWqgc+KHIgURFCH2vtMI0VY1gO0o\nUvBDTkEERZUiBWkK1UBOwQ8JzSIoQux9pxGirYoU2hlmp3Dnna2OgivDEimsBLYDO4ArUspcE32+\nDTjX2n4DsBd4MFH+RcD3gJ8D3wVOdDdZpFG1SCG05z/IKbQzzOfkz/4M9u71qzMMQvN84FqMYzgH\nuBg4O1FmNXAGcCZwGXCd9dmXo7pJPoJxCmcB/xytiy6p2jwFCMuJDXMDmEaIv1O/KPJ/GoZI4Txg\nJ/A4MAXcBKxJlLkQ2Bgt343p9S+O1u8COj100a6zEXirj9GiM82mecV/5JAJsQGWptDOMDuF6Wn/\n7z0MTmEJsMta3x1t8y2T5GRMWono/eSc8sKBKv2B4x5YSLaG6KgGTZWuqbIp6hSqLjSP5nzuKrMk\nfaOPPNPMKj85OTm7PDExwcTEhMeuh4u4p3v0KIyPD9aWPEJsgON8cEg2DZoQf6d+UWQwxKA0hUaj\nQaPRKGVfeU5hD7DMWl+GiQSyyiyNtmWxF5NiegJ4CfBkWkHbKYhsqtSrC9HWmRlYsGA4G8A0Qvyd\n+kWV0kfJDvP69esL7ysv0NmKEZCXA+PARcCmRJlNwCXR8grgGVqpoTQ2AX8eLf85cJubuSILO1II\nnRB7oM2mnEKSYXYKRSKFYdAUjgLrgM3Aw8A3gUeAtdEL4HbgMYwgvQF4r1X/RmALZpTRLuDSaPvV\nwJsxQ1LPj9ZFl1TpDxyirYoU2gnRefeLKkUKZZKXPgK4I3rZbEisr0upe3HK9v3ABQ7HFh4oUuiO\nmRmjxYRk06AJ0Xn3g3gk3zAKzRU3X9hU6Q8coq2KFNoJ8XfqB0W/9zBMXhMVIo4UqjCBLbYxpAZY\nmkI7w+4UNHlNVJoq/YFDtDWOFEKyadDMzMDo6PA5yqLzaOQURFBIU+gOaQrtxOekCtdUmXTjFKQp\niGAIsfedRoi2SlNoZ1idQtHrU5GCCApFCt0hTaGdYU2pFY0UJDSLoAix951GiLYqUmhnWFNqihRE\nLVCk0B0zMzB/vvlTV+FOs/1gWNNHEppFLQix951GiLbOzBiRcHQ0LLsGybA6hW4iBQnNIhiqFCmE\nOk9hZEROwWZYnYIiBVELik64GQSKFKrBsOosmtEsakGVIoVQNYV584yuUIVz2A8UKfjVU6QggiLE\n3ncaIdqqSKGdZnM4nYJGH4laoEihO2xNoZcpOJfvPD0dxgioYR2SGv/+Re59JKFZBEOIve804uGf\nIdnaj0hh/3542cvyy33603DtteUee9s2uPdevzqavOZXrw6agsvzFERFqFqkEJqA2Q+ncOAA7NuX\nX+63vy3/2LfdBocPw6te5V5nkJrChg1w6BBcfnn/j630kagFVYoUpqfDy1X3wykcPeq2b9dyPhR5\nkljZTmHrVveyTzwBv/mN/zH27YM//VP/ejYSmkUtUKTQHfEfupdpraNH3fLU09Nu5d75zpatTz8N\nf/mXrc/uvx+uusrv2I8+One9bE3h9a+HgwfdyhZ1jPv2wT33+Nez0eQ1UQuqNk8htFy1HSn06hxO\nTZUbKdx8s0mxADz5JNx5Z+uznTthyxa/fV5wAfzqV6Zxu/xyv0jhllvgX/4lu4zr93e1t8x6NooU\nslkJbAd2AFeklLkm+nwbcK5D3fOAnwD3AfcAr/GyWnREkUJ3VC19FD9DOC6XrJNcd0kfHT5sXtPT\ncM01pvz4uJuT/P73s9NDzaZfCmuQTkGT19KZD1yLadzPAS4Gzk6UWQ2cAZwJXAZc51D3M8D/wjiQ\nT0TroktmZmBszFzIO3bAffcN2qJ0QpwUFYf+/XAKsQPPK5dFMjJMppyS6y77jFNMcbmpKfffKW//\nvpFsEQ3ExQ7XY8f78mEYIoXzgJ3A48AUcBOwJlHmQmBjtHw3cCKwOKfub4AXRMsnAnsK2i8sms2W\nU/jWt+ArXxm0RemEOP497uX10inE3zdvDoJrA558z4oUXPdplztypDynkLTXZX9F0nhF6m3ZYjSZ\nGI0+SmcJsMta3x1tcylzSkbdjwCfA34FfBa40stq0RE7UnAVKgdFyJpCr4VmyP9tXH4/X6fgus+Q\nnEKR36FIhPGpT8EPfmCW3/EO2L27ZYMPdRCa8+Yp5AS5s/j6xuuB9wPfAv4bcAPw5k4FJycnZ5cn\nJiaYmJjwPNTwYEcKRUPvfhFqpNAPoRlaufo0QooU4msqj7z9+6Zk+pk+sqOLn/4U/vAPW9t9GFSk\n0Gg0aDQapewrzynsAZZZ68swPf6sMkujMmMZdc8DLoiWbwH+Ic0A2ymIbOw8fa+dwuHDpgEdGytW\nf3o6vEihX5qC/Z5Vrmyn4HJNpGkKLk4yL23Tr0ihqFOw7Tt82Cz7dg4GJTQnO8zr168vvK+8QGcr\nRkBeDowDFwGbEmU2AZdEyyuAZ4C9OXV3An8ULZ8P/Lyg/cKin5HCpz8NX/xi8fqhjj7qtabQC6dQ\nttBsN+4+6aO8a841deZjb1q96el8MT/tWLZTqEqkUCZ5kcJRYB2wGTOa6HrgEWBt9PkG4HbMCKSd\nwEHg0py6YEYp/R9gAfB8tC66xI4UZmZ66xSefTY7/ZHHzAwsXBhWpNCPIal2+iiLQaSPZmbah7mW\nqSn4po+6cQrQur+W77GOHjXf296XK8PgFADuiF42GxLr6zzqgokiXutwbOFBHCnEPcReCs1F/7Ax\noWsKVRWam83W9/AVmjs5l1hTiHveWQ1e2UJz0WvYPo6PU7Ajrm6cQtWF5oqbL2z6qSmU4RRC1RT6\nMfqoV5FC8t0nUuhUb2rKnI9589xHLrnam0e3kYJPXUUKLeQUakQ/NYU8UTGPbiOFIjdKy8PWFPox\n+iiLQToF+9o5csQ9esq7JkJ2CvbtN7rRFIZhRrOoEMl5Cr10Cj73sOlEtzOaX/rS1h+3LPqZPirT\nKSQfCJMlPPtGCrZT6DZS8H1wTVGnUGQ2siKFFnIKNaLfkUI3+49vnV20R37gQPl6RB2E5uR70fSR\nPfrI9Zz4OB0XupmnENf3qZN0CkWuAzkFERTDoinMzBQbXXXvvfDYY+mf24/j7HWk0CuhOfmedApF\nhGaf9FHZmkK3QrNPHTvCOHKk+PUppyCCIRkpVGH0Ub/SAwDXXw/f/na2TXUWmoukj6am3M+Ja/oo\nRE3BPtb0tElN+jqFeF5E1Z2CHsdZI+yGNh5v3iuK9uJiunEKRf70cfksm/t9m4sseqEpuPbkQxGa\nu00fFXEK8VyNw4f9r886iMygSKFW9FNoLiNScL2nTqdj2+8+9bLqVFVo7oWm0MkplDUktR8zmu13\nF+KBE/b3LhIpyCmIoGg2W+JtFZxCUaHZdxSLXS/L5n5qCqGnj4oIzaGlj4oIzbZT8L0+6zBxDeQU\nakXVIoVBpI8GHSnE6aOqCM2xpjCI0UdFU5RF00fJtJnv9VmXSEGaQo2wheb4Nge9olunEA9JHTan\nUJVIoaimUKZTKNqx6WaeQlxHmoKoBf18yE4ZkULRIX/dOAUXobmXo4/6LTTD3KeIueb87WWf0UdV\nndEcH8tOm0lTEJUn1hSSvZ5eUDS0jwlRaLY1hV451H5HCsl330gByp/RHJpTaDZbjrCbSEFOQQTH\nsNzmItlD9qk3bOkj+73IXVKh/PSR6+/WrxnNnSKkopGChGYRFHakUBWhuZvRR1XUFPotNCffXSMF\n+9h1n9Hc6fwMs9Asp1AjNPoov96gnUKV00d59uRdc6Gmj9Kcgm+kIKFZBEdynkLoQnNoM5rjnl7V\nbnORJzTb767pHbvc/Pn1Fpo7OYWit7mog1PQkNQa0e9IoVuheRCjj1wihZGRat3mol+RQr8fstOv\n21x0SpsNs9Asp1Aj+j36qJv9T093P/qoV0JzryOFvO9tPys5b1++71USmoteY0We2xCX7yZ9NExC\n80pgO7ADuCKlzDXR59uAcx3rvg94BHgI+Bt3k0UaVdQU+jVjNS4/aE1hagoWLsz+3q6Nmq9TiK+J\n+G6eWfvzdQoutzMvoin04/qwoze7TpHbXAxDpDAfuBa4ANgD3ANswjTmMauBM4AzgdcC1wErcuq+\nEbgQeAUwBZxUyrcZcqr0kJ1B3Do7z+Z+3fto4cL8HrXLjPQikQKYc9/pgfZpEYWLU3D5TYqkdZrN\nlrN2pQxNATSjOY3zgJ3A45jG+yZgTaLMhcDGaPlu4ERgcU7d9wBXRdsBnipov7Co2kN2QhOa+zX6\n6Jhj8hvPPMcRlwM/odmul7W/ZKSQl1JziW6KaAo+5YsepyynUJdIIc8pLAF2Weu7o20uZU7JqHsm\n8Abgx0ADeLWP0aIz/X7IThWfp+CqKfRSaHaJFMbHW73krHK+71l58rz0UbcNfpH0UZFr5OhRP8ee\nFiGlnasDB+A732nfXhdNIS99lJJ9bMPXP44CL8SkmV4D3Ayc1qng5OTk7PLExAQTExOehxoekpFC\nnOftxYVaRqQwOtqf9IBdb9Cagmv6aP78lh3j4+nl7EYz6z0Wr7Py5HbayldTcPlNkpFNFrEzLOoU\nFizoTmgG851jWw4cgDVr4Pvfh23bYP16eMtb5u5nkJFCo9Gg0WiUsq88p7AHWGatL8P0+LPKLI3K\njGXU3Q3cGi3fA8wALwb2JQ2wnYLIxo4U7As9VKcQN3y+Nvo0Lsl6oWgKeULz6Khb79xORSUdjh0Z\n2PvMihTi+r1yCi5pMTD22teHD3kRUafy8btdx3bMzz4LDz7Ysq2TTYN0CskO8/r16wvvK++vuBWT\n6lkOjAMXYcRim03AJdHyCuAZYG9O3duA86Pls6LP2xyC8MMe0VM0H+tKt/c+ih1BkQa4ypGCa/oo\nrwGPy6U5geR6MvrI2l/cY1640Gx3dQp532t62t0pxOegyPBgH+cTl4/f05yC/VnadVQXoTkvUjgK\nrAM2Y0YTXY8ZPbQ2+nwDcDtmBNJO4CBwaU5dgBui14PAEVpORXRBUlOA3jRuLsMPXfZRtAHuRoAM\nQWg+7rjynIKdJpmebl+3G3mfSCHe16FDbkJzXPfIkfwyPk6h6PXh4xSmpkxjnhUhuTiFugjNLpPX\n7oheNhsS6+s86oIZdfQuh2MLD5LzFKA3gmkZDqebBrjXkUKvn6fgGim4NsRZ6SO7kXdxCnZksWCB\n2e4iNMcN8XPPZdvrmtZxiWyy6vpGCp3SZr6RQl2E5hp8BRHTr0gh3me3o4+KNsC9cgr9ep6Cr9Ds\nuq+s9XifWSOrkuV900d5DX4yssnCxYmVcZy4fBxRTU+3evv297ZTsmnDvesSKcgp1Ijk6CPorVMo\nK1IoIiRCdZ+nUKbQnOcU7J6/r9Ds6xTGx1upxbTv1Y/0UbeRQvy9O0UK8e1HOv0uddEU5BRqRHL0\nUdF7C+VRxr7t0UehRAp1Fpp9Rh8VFZrHxvIjEd/0UZE5I906hWTazL5uYi1NkYKoBPHY/5GRYjf0\ncsX3T9eJQWkKLrfODmGegqum4CM0u44+is+T3Ti62JIX3fhcN/2OFOyIyo4UYqdkX3NyCqIy2I1a\nkfvBu1KGU+hmSGqR1JjLiKl+3SXV5TYXRSOFQQnNLjb7pI/K0BRc69nRW1qEZJ/TLE1BQrMICrv3\nHTuFXgimdv447Y6befQ7UnBxJN3oHK64po/KEpqTmkKvhGYfp+Nybl3PQdZxfCKFY45pT5vZx0+K\nzIoURCWwIwXobaQwNla88YwdSdGnnMXlfY7t4kjqKDQnRx/1UmjOe0KbT2PdTfrITpu5kIyo8iKF\ntDSkhGYRHHb6A3rrFIrONoW59zrqZvSRz7Fd6vRDU+j1PIUyheZOgmueza5OJ4/Y3kEKzcnRR3FZ\nRQqiMvQzUijai4N2p1AkUvAd/eQSXYR0Q7xuZzTHvdb4tie+jXYyUihDaA55SGonLUVOQVQeu1GD\n4remzmNqqpU+KuoU4mimaHrA1+GFlD7qh9CcTBe5po/syKJsodmnsXaxN6tuGfMU8oTmpJ4moVkE\nhx0pFL3DpAsuvcIsyogUfEc/xTa7OIVe3+bCZeZvt0JzspF2Sce4NI5ZtpQtNPd79JGP0Aztk/QU\nKYjgsHu6RXtZLpSZPurmLpi+QnOeI+n1bS7iYbF5DWMZQnPyN+o2feQ6+ijr9/SJ8LodkuorNMfR\nm0ukkJaKlNAsgqNTpNBLp1C0R20/P6Go0FwkUshrkHqdPoobujw9xPX8ZmkKycjANX3UjdDsM7op\nj3h/RYVm3yGpnSbtZWkK8bJNXSKF0UEbIMqjipFCP9IDcZ2FC80TtPLsGh01M8L3lfyEj+efd9cK\nimoKac9P8Bl91KnHXNaM5n4MSS2iKcTzbuI7AUC2phAv29RFU5BTqBH9jhSq6BRcRh8tWgQnnghn\nneVnlwsvfWlvnUIv00f9nNHczTXm+zyFo0db9206fNjtNhfxso0iBREcdk+3m0Y7j0E7Bd8/Pcx1\nJGl/3nj7ggXwy1/62eRDo9F9KiYu5+MUXG6dnTX6qFtHlkx3ZTE93d8ZzbHthw/D8ceb7clbZ8d2\n1d0p1CDYETHxRRn/+YvkY11wSRVkYQ9J7cfjFuM64+Pmj552a2fbWfWSvPPmOnErL31k6xJF0keD\nnLxWRvrI9dqcmmod69Ch9Ftnx/uOlyU0i+Dpp6YQh9tlRApFhWbf0Ud54m0/nUJZ6aM8oTk+vy7R\nh31eO6WPsmyJe/Zl3+bCt2MTP++gaKRw6FB3moKcgggKaQrZdfJsrqJTcJ28FoLQ7HuX1CLXcPwb\n+kzcTGoK3Yw+qoPQ7PIVVgLbgR3AFSllrok+3wac61H3g8AM8CJHe0UGVRl9lByS2q/0UV6j1a+e\nXi+cQrKH3ElTGLTQ3I/0UZF6yUjBNX00rJHCfOBaTON+DnAxcHaizGrgDOBM4DLgOse6y4A3Az2U\n9IaLfkUKdg5WkYI/Lr1uX6E52UPu5BR8hGZbU3C5SaCrU+j1jGaXNGHWsezRR75C87BoCucBO4HH\ngSngJmBNosyFwMZo+W7gRGCxQ92/BT5c2HLRRnL0Ua9u1+DS63axE/o7+igUp9ALodlu9G2n4Cs0\nL1jQehjRggWmkSvLKfjMaC7qFOy0k8+M5jKE5rpECqM5ny8Bdlnru4HXOpRZApySUXdNtP6Ap70i\ng37f+6gbodkefVR0xmpVheaxMdi9G97+9s6fP/ww/PEfm3J///dmCGsn9u9vCcNJYTnZONoN3/79\n8MQT7fs7dKh9vL6r83Y5vz7pI1u4LvI7d5M+GnahOc8puD5Xy+dUHAN8FJM6yq0/OTk5uzwxMcHE\nxITHoYaLqmgKg7whXtbx+vWnPu002LjRzJ7txFvfCq97nUnT3X13+n7e8Q44+WQ3DSGOJE47Ddav\nN84mydgYvPjFc3vMrveoslNeLjfcyyO2f2wM/vEf4Uc/yq8Dxpn53sHXTocePmzeY3G9KkJzo9Gg\nkdZ78CTPKezB5P5jlmF6+FlllkZlxlLqng4sx4jScfl7MemmJ5MG2E5BZJOcpyCnMLdOXsqrX5HC\nvHnwtre5lT311OzPn3/ezSnEkcR73mNeWXRyCq4pL5f0lI9TeN/74DWvyS9vc+WVpu6vfgUf+EB+\n+XvugVWrWhFS/D3ybogXUqSQ7DCvX7++8L7ynMJWjIC8HPg1cBFGMLbZBKzDaAYrgGeAvcC+lLqP\nACdb9X8BvArYX/hbCKD/8xSq6hQGnT4qk9FRE3Fs3jw3PbRlS2v9l780v1ecK3fZ58GDpgH3SR+N\nj7tpCscdl3+em02YnIQlS+BP/sTNbptDh+ATnzBRQB5r18IFF8DVV8O///tcTc7WZOLvUHehOc8p\nHMU0+Jsxo4muxzTqa6PPNwC3Y0Yg7QQOApfm1E1S8NHvIomtKXTTk8/Dzh8X0SzKGJJa5dFHZTI6\narSJr34VLroIli2Dl70M7roL3vIWeMUrjDPYtQve/W63fY6Pm3c7Ujj2WHjwwfTIZf9+0wiPjsJP\nftK6VYTNwYNm3643GuymgV240EQZPsQRUjJSSDoC20HYDIumAHBH9LLZkFhf51E3yWkONggHkpFC\nP25z0W2kUESstmfuuhKSplAmIyPw9a/P3fZP/zR3/Tvf8dvn5s2mcTzpJKNvgLmR32OPZfe8ly6F\nm282rxtuaP981Spzo8FQHW/SKQzrPAUXpyAqQqfRR1u2wBe/WO5xfvhD0wMtK33Ur+cphDL6KHTO\ntaaffu1RLl0IAAAKXklEQVRrreWlS/PrvvOd5lVFbKHZ1uWOHAlfaC4TOYUakYwUVq2Cp56Chx4q\n9zhLl8Lq1cbZdDskNf7T+VDUKeSNjpFTGG7iDkN8ncT/peeea3cKnTpEihREcCQjhRUrzKtX/N3f\nlRMpPPecX/0iTsFldExdhEJRjBe8wLyfcEJ7+iieMBnPAel0/dXl+pFTqBFJobnXlHWX1FBGH9Ul\n/BfFuPXW1vMUPvxhOOWUuZpC8rbiwyw0iwrQjMZw2ZFCryk6Y7pboTntT5lXp46jj0R5jI+3Rl6t\ni4bOZDkFaQoiaJINbT+cwgknwAc/CB//uF+9qSl49avNchHH4nMPnRgJzaIIaU6hU6SqSEEEhX1B\n9itSuOoqE2YXIR7HHtqM5jr8qUV52E7BflSpnIIInmSevl/po5NO6n4f0hREqNhCc5yyTEsf1aVT\nob9ATUhGCv0QmssgJKeg9JFIkpU+ktAsgmYQkUIZjI7C1q1+usRvf1tMU1i4UE5B+BHfFcBVU6jD\n9SOnUBMGoSmUwfnnm/vyND3ugPWpT8HixeYmb8ce61bnyBH4/Oc1T0H44Tv6qA7Xj5xCTahqpLB0\nKXzsY8Xq7tvnFy0sWmRu+5H1jOY69PREedhO4fjj5+oLcgoiaKoaKXTDggWtp2S5Mjpqnnq2Y0f7\nZ1NTcgpiLmlCs2Y0i+AZxDyFKvLyl5vbc3R68tiyZeZe/0LESGgWlcW+IFev9n9a1bDwoQ+ZlxAu\n+E5eq0OkKadQE+xI4dRT8x/jKITIJ+kUDhyov6ZQA78moD4XpBAh0WlGsyaviUqgMfZClI+P0FyX\njplrM7IS2A7sAK5IKXNN9Pk2wHp2U2rdz2Ke2bwNuBV4gbPVoo26XJBChISv0FyHjpnLV5gPXItp\n3M8BLgbOTpRZDZwBnAlcBlznUPe7wO8DfwD8HLiy6JcQihSE6AWdnII0BTgP2Ak8DkwBNwFrEmUu\nBDZGy3cDJwKLc+p+D5ix6jg8AVakUZcLUoiQiG+1HjuF+NGx4+PD7RSWALus9d3RNpcypzjUBXg3\ncLuDLSIFRQpClE98q/VYXD50KP25HMMkNLvelabo6fgYcAT4RsH6gvr0UoQIiaTQfPhw+t126/If\ndJmnsAdYZq0vw/T4s8osjcqM5dT9C4we8aa0g09OTs4uT0xMMDEx4WDy8KFIQYjySWoKhw6ZKKHT\nw5oGKTQ3Gg0ajUYp+3JxClsxAvJy4NfARRjB2GYTsA6jGawAngH2Avsy6q4EPgT8EXAo7eC2UxDp\n1KWXIkRIJJ1CqJFCssO8fv36wvtycQpHMQ3+ZsxoousxQ0nXRp9vwOgBqzGi8kHg0py6AF8AxjGC\nM8CPgPcW/iZDjiIFIcqnU6QQolMoE9fbXNwRvWw2JNbXedQFE0GIkqjLBSlESCRnNGc5hWESmkUF\nUKQgRPl0EprjuxDXNVJQM1IT6tJLESIkRkfNczbiSMHWFEISmsukBl9BQH0uSCFCYnTUTFibN89M\nWBsGTUHNSE1QpCBE+YyOzo0O7OXnn4enn245BzkFERSKFIQon9FoKE48NyFePvlkeOAB84zxyy4z\n2+vSMdNDdmpCXS5IIUJi3jz4whdM6uh3fxeuvto8wOqVr4R/+zf49rdhQzQOsy6RgpxCTVCkIET5\njIzAOmuw/RWJBwccfzw8+6xZrst/sAZfQYAiBSEGQdIp1OE/KKdQE+rSSxGiSthOoS4dMzUjNaEu\nF6QQVUKRgggWRQpC9B9pCiJYFCkI0X+OPdZMaJueVqQgAqMuvRQhqsTIiHEMBw7IKYjAUKQgxGCI\nU0h1+Q/KKdQERQpCDIbjj1ekIAKkLr0UIapGHCnUpWNWg68goD4XpBBVw3YKdeiYqRmpCYoUhBgM\nxx0npyACRJGCEINhGIXmlcB2YAdwRUqZa6LPtwHnOtR9EfA94OfAd4ETvawWbdTlghSiagxb+mg+\ncC2mcT8HuBg4O1FmNXAGcCZwGXCdQ92PYJzCWcA/R+u1o9Fo9O1YZUcK/bS9F8j+wTJM9g+b0Hwe\nsBN4HJgCbgLWJMpcCGyMlu/G9PoX59S162wE3lrQ/qDp5x+j7EhhmP7UISL7B0tRp1CHSCHveQpL\ngF3W+m7gtQ5llgCnZNQ9GdgbLe+N1jvyzDPmfWTEPPlo0aJ6nHgXDhww39fufezbZ54Zm2Tfvnr0\nUoSoGscfDz/7GbzwhTA2NmhruifPKTQd9+PSTI+k7K+ZdZzly40HBpiaMj3i+fONYxgZaX3WbM5d\n7rRtZMQ8NWnhQnjsMXPPkjSaOd/c5fOZGfjrv+78+aJF8Du/0/oOSdunp+Gpp8wTn044wWw7csTY\nvGhR532+7W3ZNgkhyuf3fg8+9znzX/3EJwZtTe9ZAdxprV9Ju9j8JeDt1vp2TM8/q+52TIoJ4CXR\neid20nIaeumll156ub120iNGgUeB5cA4cD+dhebbo+UVwI8d6n6GloP4CHB16ZYLIYToCauAf8V4\nniujbWujV8y10efbgP+YUxfMkNT/h4akCiGEEEIIIXxwmTAXGo8DDwD3AT+JtoU8Se8GzMivB61t\nWfZeifk9tgP/pU82ZtHJ/knMKLf7otcq67OQ7F8GfB/4GfAQ8P5oe1XOf5r9k1Tj/C/EDJ+/H3gY\nuCraXpXzn2b/JNU4/97Mx6SblgNjdNYxQuQXmIvK5jPAh6PlKwhLO3k9Zva53aim2XsO5ncYw/wu\nOxn8LVI62f9J4AMdyoZm/2LgldHycZgU69lU5/yn2V+V8w8Qj+Ebxeigr6M65x8621/K+R/0F+uE\ny4S5UEkOzQ15kt5dwNOJbWn2rgFuxPwej2N+n/N6b2ImneyHzsOjQ7P/CcyfFOAA8Ahmbk9Vzn+a\n/VCN8w/wXPQ+jumIPk11zj90th9KOP8hOoW0yXCh08SI51uB/x5tc56kFwhp9p6C+R1iQv5N3ocZ\n8HA9rfA/ZPuXYyKeu6nm+V+OsT8edViV8z8P49j20kqFVen8d7IfSjj/ITqF5qANKMh/xvw5VgH/\nA5PesInHD1eFPHtD/C7XAadiUhu/AT6XUTYE+48D/i9wOfBs4rMqnP/jgFsw9h+gWud/BmPnUuAN\nwBsTn4d+/pP2T1DS+Q/RKezBCFkxy5jr5ULlN9H7U8C3MOHZXuZO0ntyAHb5kGZv8jdZGm0LjSdp\n/Zn/gVaIHKL9YxiH8FXgtmhblc5/bP/XaNlfpfMf81vgO8CrqNb5j4ntfzXVPP9OuEyYC41FwPHR\n8rHADzEKf+iT9JbTLjR3sjcWqsYxPZFHcbu1Sa9Zzlz7X2It/0/gG9FyaPaPAF8BPp/YXpXzn2Z/\nVc7/f6CVWjkG+AHwJqpz/tPsX2yVCfn8FyJt0luonIo56fdjhujFNoc8Se9G4NfAEYyGcynZ9n4U\n83tsB/5rXy3tTNL+d2MaqgcwOdXbmKvhhGT/6zDh//20hg+upDrnv5P9q6jO+X858FOM/Q8AH4q2\nV+X8p9lflfMvhBBCCCGEEEIIIYQQQgghhBBCCCGEEEIIIYQQQgghhBBi2Pj/P1hQgT8UGcoAAAAA\nSUVORK5CYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x103aff2d0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "print(\"-- above--- only KS\")\n",
    "print(\"KS,P,TS: 1,1,1 below, TSP is derived from concept-proficiency table\")\n",
    "uid=(lids[6]['learner_id'])\n",
    "print(\"learner is:\"+uid)\n",
    "relDict3 = session.execute(\"SELECT relevance from learnerconceptrelevance WHERE learner_id='\" + uid + \"'\")[0]['relevance']\n",
    "# read relevancy screo tables\n",
    "y3 = relDict3.values()\n",
    "print(\"concept relevancy scores:\")\n",
    "plt.plot(y3)\n",
    "print(\"top 10 recommended concepts are:\")\n",
    "print(sorted(relDict3.items(), key=lambda x: x[1],reverse=True)[:10])\n",
    "print(\"bottom 10 recommended concepts are:\")\n",
    "print(sorted(relDict3.items(), key=lambda x: x[1])[:10])\n",
    "\n",
    "profDict = session.execute(\"SELECT proficiency from learnerproficiency WHERE learner_id='\" + uid + \"'\")[0]['proficiency']\n",
    "n=len(profDict)\n",
    "if n>0:\n",
    "    k=min(5,n)\n",
    "    print(\"top concepts:\")\n",
    "    print(sorted(profDict.items(), key=lambda x: x[1],reverse=True)[:k])\n",
    "    print(\"bottom concepts:\")\n",
    "    print(sorted(profDict.items(), key=lambda x: x[1])[:k])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
